Catalogs/рс_ТехническоеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_ТехническоеЗадание</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>рс_Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Разделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_СтатусыТехЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Требования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Требование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Требования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обсуждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_Требования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Требования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>рс_Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_СтатусыТребований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обсуждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_ТехническоеЗадание/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ОписаниеЗадания) Тогда
		ЗаданиеДокумент.УстановитьHTML(Объект.ОписаниеЗадания, Новый Структура);
	КонецЕсли;
	
	ОбновитьЧат();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаданиеДокумент.ПолучитьHTML(ТекущийОбъект.ОписаниеЗадания, Новый Структура);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьСообщениеЗавершение", ЭтотОбъект);
	ОткрытьФорму(
		"Справочник.рс_Требования.Форма.ФормаВводаСообщения",
		Новый Структура,
		ЭтаФорма,
		,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСообщениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСообщениеНаСервере(Результат.Текст);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСообщениеНаСервере(ТекстСообщения)
	
	НоваяСтрока = Объект.Обсуждения.Добавить();
	НоваяСтрока.рс_Сообщение 	= СообщениеВСтрокуХранения(ТекстСообщения);
	НоваяСтрока.Автор 			= ПараметрыСеанса.ТекущийПользователь;
	НоваяСтрока.Дата 			= ТекущаяДатаСеанса();
	
	ОбновитьЧат();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЧат()
	
	МассивЭлементов = Новый Массив;
	
	Для Каждого СтрокаОбсуждения Из Объект.Обсуждения Цикл
		
		ФорматированнаяСтрокаСообщения = СообщениеИзСтрокиХранения(СтрокаОбсуждения.рс_Сообщение);
		Если ПустаяСтрока(Строка(ФорматированнаяСтрокаСообщения)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивЭлементов.Количество() > 0 Тогда
			МассивЭлементов.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));  
			МассивЭлементов.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
		МассивЭлементов.Добавить(ФорматированнаяСтрокаСообщения);
		
	КонецЦикла;
	
	Если МассивЭлементов.Количество() = 0 Тогда
		Чат = Новый ФорматированныйДокумент;
	Иначе
		ФорматированнаяСтрокаЧата = Новый ФорматированнаяСтрока(МассивЭлементов);
		Чат = Новый ФорматированныйДокумент;
		Чат.УстановитьФорматированнуюСтроку(ФорматированнаяСтрокаЧата); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СообщениеВСтрокуХранения(ТекстСообщения)
	
	Если ТипЗнч(ТекстСообщения) = Тип("ФорматированнаяСтрока") Тогда
		Возврат XMLСтрока(ТекстСообщения);
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Функция СообщениеИзСтрокиХранения(ЗначениеСообщения)
	
	Если ТипЗнч(ЗначениеСообщения) = Тип("ФорматированнаяСтрока") Тогда
		Возврат ЗначениеСообщения;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеСообщения) Тогда
		Возврат Новый ФорматированнаяСтрока("");
	КонецЕсли;
	
	Попытка
		Результат = XMLЗначение(Тип("Строка"), ЗначениеСообщения);
		Если ТипЗнч(Результат) = Тип("ФорматированнаяСтрока") Тогда
			Возврат Результат;
		КонецЕсли;
	Исключение
		// Сообщение сохранено как обычная строка.
	КонецПопытки;
	
	Возврат Новый ФорматированнаяСтрока(Строка(ЗначениеСообщения));
	
КонецФункции
